# coding: utf-8

etc_dictionary = {
    "1+1": "วันพลัสวัน",
    "2+1": "ทูพลัสวัน",
    # TODO: Add more Thai-specific abbreviations or special cases
}

english_dictionary = {
    "IT": "ไอที",
    "IQ": "ไอคิว",
    "PC": "พีซี",
    "CCTV": "ซีซีทีวี",
    "SNS": "เอสเอ็นเอส",
    "AI": "เอไอ",
    "CEO": "ซีอีโอ",
    "A": "เอ",
    "B": "บี",
    "C": "ซี",
    "D": "ดี",
    "E": "อี",
    "F": "เอฟ",
    "G": "จี",
    "H": "เอช",
    "I": "ไอ",
    "J": "เจ",
    "K": "เค",
    "L": "แอล",
    "M": "เอ็ม",
    "N": "เอ็น",
    "O": "โอ",
    "P": "พี",
    "Q": "คิว",
    "R": "อาร์",
    "S": "เอส",
    "T": "ที",
    "U": "ยู",
    "V": "วี",
    "W": "ดับเบิลยู",
    "X": "เอ็กซ์",
    "Y": "วาย",
    "Z": "แซด",
}
